project/integrations/KNX_CREATE_CONTACT_01.00.0000/resources/application_134/inbound_135/resourcegroup_136/createPersonAndRelationship_REQUEST_RT.wsdl

<wsdl:definitions         targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/createPersonAndRelationship_REQUEST"     xmlns:plnk="http://schemas.xmlsoap.org/ws/2003/05/partner-link/"     xmlns:errors="http://xmlns.oracle.com/adf/svc/errors/"     xmlns:orafault="http://xmlns.oracle.com/oracleas/schema/oracle-fault-11_0"     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"     xmlns:tns="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/"     xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"     xmlns:types="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/"     xmlns:ns0="http://xmlns.oracle.com/cloud/adapter/erp/createPersonAndRelationship_REQUEST/types"     xmlns:ns1="http://xmlns.oracle.com/cloud/adapter/erp/createPersonAndRelationship_REQUEST"    >    <casdk:RuntimeIntegrationModel xmlns:casdk="http://xml.oracle.com/wsdl/extensions">        <casdk:sourceWSDLMetadata>            <casdk:serviceName>{http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/}PersonService</casdk:serviceName>            <casdk:portTypeName>{http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/}PersonService</casdk:portTypeName>            <casdk:portName>PersonServiceSoapHttpPort</casdk:portName>            <casdk:endpointURL>ENDPOINT_URL</casdk:endpointURL>            <casdk:targetWSDLNS>http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/</casdk:targetWSDLNS>            <casdk:soapVersion>SOAP11</casdk:soapVersion>        </casdk:sourceWSDLMetadata>    </casdk:RuntimeIntegrationModel>    <plnk:partnerLinkType name="createPerson_plt">        <plnk:role name="createPerson_role">            <plnk:portType name="ns1:createPersonAndRelationship_REQUESTPortType"/>        </plnk:role>    </plnk:partnerLinkType>    <wsdl:types>        <xs:schema xmlns="http://xmlns.oracle.com/cloud/adapter/erp/createPersonAndRelationship_REQUEST/types"             elementFormDefault="qualified" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/createPersonAndRelationship_REQUEST/types">            <xs:element name="createPerson" type="xs:anyType"/>            <xs:element name="createPersonResponse" type="xs:anyType"/>        </xs:schema>        <xs:schema xmlns="http://xmlns.oracle.com/adf/svc/errors/" elementFormDefault="qualified"             xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/adf/svc/errors/">            <xs:element name="ServiceErrorMessage" type="xs:anyType"/>        </xs:schema>    </wsdl:types>    <wsdl:message name="createPersonRequestMessage">        <wsdl:part name="parameters" element="ns0:createPerson"/>    </wsdl:message>    <wsdl:message name="createPersonResponseMessage">        <wsdl:part name="parameters" element="ns0:createPersonResponse"/>    </wsdl:message>    <wsdl:message name="ServiceException">        <wsdl:part name="parameters" element="errors:ServiceErrorMessage"/>    </wsdl:message>    <wsdl:portType name="createPersonAndRelationship_REQUESTPortType">        <wsdl:operation name="createPerson">            <cloud:CloudOperation xmlns:cloud="http://xml.oracle.com/types" targetOperation="createPerson"/>            <wsdl:input message="ns1:createPersonRequestMessage"/>            <wsdl:output message="ns1:createPersonResponseMessage"/>            <wsdl:fault name="ServiceException" message="ns1:ServiceException"/>        </wsdl:operation>    </wsdl:portType></wsdl:definitions>