extra/payload.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>jgonzalez</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Medix2015</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/">
		<ns1:createPerson>
			<ns1:personParty xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/">
				<ns2:CreatedByModule>AMS</ns2:CreatedByModule>
				<ns2:PersonProfile>
					<ns2:PersonFirstName>Andy</ns2:PersonFirstName>
					<ns2:PersonMiddleName>Randy</ns2:PersonMiddleName>
					<ns2:PersonLastName>Wilson</ns2:PersonLastName>
					<ns2:CreatedByModule>AMS</ns2:CreatedByModule>
				</ns2:PersonProfile>
				<ns2:PartyUsageAssignment xmlns:ns3="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
					<ns3:PartyUsageCode>CUSTOMER</ns3:PartyUsageCode>
					<ns3:CreatedByModule>AMS</ns3:CreatedByModule>
					<par:OwnerTableId>?</par:OwnerTableId>
				</ns2:PartyUsageAssignment>
				<ns2:AdditionalPartyId xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/">
					<ns4:PartyIdentifierType>ID_NUMBER</ns4:PartyIdentifierType>
					<ns4:PartyIdentifierValue>ID12345678</ns4:PartyIdentifierValue>
					<ns4:CreatedByModule>AMS</ns4:CreatedByModule>
					<ns4:IssuingAuthorityName>APRTO</ns4:IssuingAuthorityName>
				</ns2:AdditionalPartyId>
			</ns1:personParty>
		</ns1:createPerson>
	</soap:Body>
</soap:Envelope>