CopyOfRolecall_To_Fusion/Files/RoleCall_FU/Fusion/Customer/CreateContact/Request/2phone/CreateContact.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/" xmlns:per="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/" xmlns:par="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:sour="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/" xmlns:con="http://xmlns.oracle.com/apps/cdm/foundation/parties/contactPointService/" xmlns:con1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/contactPoint/" xmlns:par1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/partySite/" xmlns:per1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/person/" xmlns:rel="http://xmlns.oracle.com/apps/cdm/foundation/parties/relationshipService/" xmlns:org="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/orgContact/" xmlns:rel1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/relationship/">
	<soapenv:Header/>
	<soapenv:Body>
		<typ:createPerson>
			<typ:personParty>
				<per:RequestId>23456789876789</per:RequestId>
				<per:CreatedByModule>SIS</per:CreatedByModule>
				<per:PersonProfile>
					<per:PersonFirstName>MgFN_01</per:PersonFirstName>
					<per:PersonLastName>MgLN</per:PersonLastName>
					<per:CreatedByModule>SIS</per:CreatedByModule>
				</per:PersonProfile>
				<per:Relationship>
					<rel:SubjectType>PERSON</rel:SubjectType>
					<rel:SubjectTableName>HZ_PARTIES</rel:SubjectTableName>
					<rel:ObjectId>300000003009608</rel:ObjectId>
					<rel:ObjectType>ORGANIZATION</rel:ObjectType>
					<rel:ObjectTableName>HZ_PARTIES</rel:ObjectTableName>
					<rel:RelationshipCode>CONTACT_OF</rel:RelationshipCode>
					<rel:RelationshipType>CONTACT</rel:RelationshipType>
					<rel:StartDate>2020-09-24</rel:StartDate>
					<rel:CreatedByModule>SIS</rel:CreatedByModule>
					<rel:OrganizationContact>
						<rel:ContactNumber>MagicContact_01</rel:ContactNumber>
						<rel:CreatedByModule>SIS</rel:CreatedByModule>
						<rel:OrganizationContactRole>
							<rel:RoleType>CONTACT</rel:RoleType>
							<rel:PrimaryFlag>true</rel:PrimaryFlag>
							<rel:CreatedByModule>SIS</rel:CreatedByModule>
						</rel:OrganizationContactRole>
					</rel:OrganizationContact>
					<rel:Email>
						<con:OwnerTableName>HZ_PARTIES</con:OwnerTableName>
						<con:PrimaryFlag>true</con:PrimaryFlag>
						<con:CreatedByModule>SIS</con:CreatedByModule>
						<con:ContactPointPurpose>BUSINESS</con:ContactPointPurpose>
						<con:StartDate>2020-09-24</con:StartDate>
						<con:EmailAddress>test2@test.com</con:EmailAddress>
					</rel:Email>
					<rel:Phone>
						<con:OwnerTableName>HZ_PARTIES</con:OwnerTableName>
						<con:PrimaryFlag>true</con:PrimaryFlag>
						<con:CreatedByModule>SIS</con:CreatedByModule>
						<con:PhoneLineType>MOBILE</con:PhoneLineType>
						<con:ContactPointPurpose>BUSINESS</con:ContactPointPurpose>
						<con:StartDate>2020-09-24</con:StartDate>
						<con:PhoneCountryCode>test2@test.com</con:PhoneCountryCode>
						<con:PhoneNumber>test2@test.com</con:PhoneNumber>
					</rel:Phone>
					<rel:Phone>
						<con:OwnerTableName>HZ_PARTIES</con:OwnerTableName>
						<con:PrimaryFlag>true</con:PrimaryFlag>
						<con:CreatedByModule>SIS</con:CreatedByModule>
						<con:PhoneLineType>MOBILE</con:PhoneLineType>
						<con:ContactPointPurpose>BUSINESS</con:ContactPointPurpose>
						<con:StartDate>2020-09-24</con:StartDate>
						<con:PhoneCountryCode>test3@test.com</con:PhoneCountryCode>
						<con:PhoneNumber>test3@test.com</con:PhoneNumber>
					</rel:Phone>
				</per:Relationship>
			</typ:personParty>
		</typ:createPerson>
	</soapenv:Body>
</soapenv:Envelope>
