DunningLetters/DunningLetters/Files/NS_FU/Fusion/Customer/CreateContact/Request/CreateContact.xml

<soapenv:Envelope xmlns:con="http://xmlns.oracle.com/apps/cdm/foundation/parties/contactPointService/" xmlns:con1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/contactPoint/" xmlns:org="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/orgContact/" xmlns:par="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:par1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/partySite/" xmlns:per="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/" xmlns:per1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/person/" xmlns:rel="http://xmlns.oracle.com/apps/cdm/foundation/parties/relationshipService/" xmlns:rel1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/relationship/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sour="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/">

   <soapenv:Body>
      <typ:createPerson>
         <typ:personParty>
            <per:CreatedByModule>SIS</per:CreatedByModule>
            <per:PersonProfile>
               <per:PersonFirstName>TestFirstName</per:PersonFirstName>
               <per:PersonLastName>TestLastName</per:PersonLastName>
               <per:CreatedByModule>SIS</per:CreatedByModule>
            </per:PersonProfile>
            <per:Relationship>
               <rel:SubjectType>PERSON</rel:SubjectType>
               <rel:SubjectTableName>HZ_PARTIES</rel:SubjectTableName>
               <rel:ObjectId>300000006895296</rel:ObjectId>
               <rel:ObjectType>ORGANIZATION</rel:ObjectType>
               <rel:ObjectTableName>HZ_PARTIES</rel:ObjectTableName>
               <rel:RelationshipCode>CONTACT_OF</rel:RelationshipCode>
               <rel:RelationshipType>CONTACT</rel:RelationshipType>
               <rel:StartDate>2021-07-01</rel:StartDate>
               <rel:CreatedByModule>SIS</rel:CreatedByModule>
               <rel:OrganizationContact>
                  <rel:ContactNumber>TestContact1022</rel:ContactNumber>
                  <rel:CreatedByModule>SIS</rel:CreatedByModule>
                  <rel:OrganizationContactRole>
                     <rel:RoleType>CONTACT</rel:RoleType>
                     <rel:PrimaryFlag>true</rel:PrimaryFlag>
                     <rel:CreatedByModule>SIS</rel:CreatedByModule>
                  </rel:OrganizationContactRole>
               </rel:OrganizationContact>
               <rel:Email>
                  <con:OwnerTableName>HZ_PARTIES</con:OwnerTableName>
                  <con:PrimaryFlag>true</con:PrimaryFlag>
                  <con:CreatedByModule>SIS</con:CreatedByModule>
                  <con:StartDate>2021-02-10</con:StartDate>
                  <con:EmailAddress>test2@test.com</con:EmailAddress>
	   <con:ContactPointPurpose>BUSINESS</con:ContactPointPurpose>
               </rel:Email>
               <rel:Phone>
                  <con:OwnerTableName>HZ_PARTIES</con:OwnerTableName>
                  <con:PrimaryFlag>true</con:PrimaryFlag>
                  <con:CreatedByModule>SIS</con:CreatedByModule>
                  <con:StartDate>2021-02-10</con:StartDate>
                  <con:PhoneCountryCode>61</con:PhoneCountryCode>
                  <con:PhoneNumber>9717000000</con:PhoneNumber>
                  <con:PhoneLineType>MOBILE</con:PhoneLineType>
	    <con:ContactPointPurpose>BUSINESS</con:ContactPointPurpose>
               </rel:Phone>
                <rel:Phone>
                  <con:OwnerTableName>HZ_PARTIES</con:OwnerTableName>
                  <con:PrimaryFlag>true</con:PrimaryFlag>
                  <con:CreatedByModule>SIS</con:CreatedByModule>
                  <con:StartDate>2021-02-10</con:StartDate>
                  <con:PhoneCountryCode>61</con:PhoneCountryCode>
                  <con:PhoneNumber>9717000000</con:PhoneNumber>
                  <con:PhoneLineType>GEN</con:PhoneLineType>
	    <con:ContactPointPurpose>BUSINESS</con:ContactPointPurpose>
               </rel:Phone>
            </per:Relationship>
         </typ:personParty>
      </typ:createPerson>
   </soapenv:Body>
</soapenv:Envelope>
